maya-taylor/Project2ELEC291/JDY40 EFM8 Files/EFM8 Example Code/Clon/Clon_EFM8LB1.c
// Clon_EFM8LB1.c: This program copies the entire flash memory from one EFM8LB1 to another
//
// (c) 2008-2018, Jesus Calvino-Fraga
//
// Pin connections (LQFP32 packages):
//    Source EFM8LB1:    Connects to:
//    P1.0   ->  RST' of target EFM8LB1 (this is C2CK)
//    P1.1   ->  P3.7 of target EFM8LB1 (this is C2D)
//    P3.7   ->  The go push-button.  Already connected to BOOT push button. Press to start clonning!
//    P1.3   ->  To 330 ohms + LED + base of pnp.  Emmiter to 5Vo, collector to 5Vi of target EFM8LB1
//    P1.4   ->  Green LED + 330 ohms to 5V
//    P1.5   ->  Red LED + 330 ohms to 5V
//    GND    ->  GND
//
// The next line clears the "C51 command line options:" field when compiling with CrossIDE
//  ~C51~  
  
#include <EFM8LB1.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define SYSCLK      48000000L  // SYSCLK frequency in Hz
#define BAUDRATE      115200L  // Baud rate of UART in bps

// FLASH and device information
#define  FLASH_SIZE        0x10000L          // FLASH size
#define  NUM_PAGES         FLASH_SIZE/0x200L // Number of 512-byte FLASH pages
#define  BLOCK_SIZE        64                // The size of the read and write buffers in idata
// 1024 bytes (0x400, 2 pages) from 0xFC00 to 0xFFFF are not available for program storage.
#define  NUM_BLOCKS        ((FLASH_SIZE-0x400)/BLOCK_SIZE)
// Device ID should be 0x34 for EFM8LB1
#define EFM8LB1_ID       0x34

// C2 status return codes
#define INVALID_COMMAND   0x00
#define COMMAND_FAILED    0x02
#define COMMAND_OK        0x0D

// From AN127 Table 3.1. C2 Flash Programming Commands
#define BLOCK_READ        0x06
#define BLOCK_WRITE       0x07
#define PAGE_ERASE        0x08
#define DEVICE_ERASE      0x03
#define GET_VERSION       0x01
#define GET_DERIVATIVE    0x02
#define DIRECT_READ       0x09
#define DIRECT_WRITE      0x0A
#define INDIRECT_READ     0x0B
#define INDIRECT_WRITE    0x0C

// C2 Registers
#define  FPDAT             0xB4 // For the EFM8LB1 only
#define  FPCTL             0x02
#define  DEVICEID          0x00
#define  REVID             0x01

// C2 Signals
#define C2CK  P1_0
#define C2D   P1_1

// Push buttons and LEDS
#define FGO   P3_7 // Go push button
#define PWR   P1_3 // Power on/off for target controller 0:on
#define GLED  P1_4
#define YLED  P2_1
#define RLED  P1_5

// Misc constants
#define  LOW               0
#define  HIGH              1
#define  LEDON			   0
#define  LEDOFF            1
#define  PWRON             0
#define  PWROFF            1

// Program MACROS
#define  Poll_OutReady     while(!(C2_ReadAR()&0x01)) 
#define  Poll_InBusy       while((C2_ReadAR()&0x02))
#define  StrobeC2CK        C2CK = LOW; C2CK = HIGH
#define  C2D_DriverOn      P1MDOUT|=0x02; // Configures C2D pin as push-pull output
#define  C2D_DriverOff     P1MDOUT &= ~(0x02);P1 |= 0x02  // Configures C2D pin as open-drain input

unsigned char NUM_BYTES;
unsigned int  FLASH_ADDR;
unsigned char idata * C2_PTR;
unsigned char idata R_BUF[BLOCK_SIZE];
unsigned char idata W_BUF[BLOCK_SIZE];

// Utility functions
void Timer3us(unsigned char);
void waitms(unsigned int);

struct _id {
   unsigned char device_id;
   unsigned char derivative_id;
   char * description; // The Flash size is embedded in the description string: F16, F32, or F64
};

const struct _id id[]=
{
	{0x34, 0x41, "EFM8LB12F64E_QFN32"},
	{0x34, 0x42, "EFM8LB12F64E_QFP32"},
	{0x34, 0x43, "EFM8LB12F64E_QSOP24"},
	{0x34, 0x44, "EFM8LB12F64E_QFN24"},
	{0x34, 0x45, "EFM8LB12F32E_QFN32"},
	{0x34, 0x46, "EFM8LB12F32E_QFP32"},
	{0x34, 0x47, "EFM8LB12F32E_QSOP24"},
	{0x34, 0x48, "EFM8LB12F32E_QFN24"},
	{0x34, 0x49, "EFM8LB11F32E_QFN32"},
	{0x34, 0x4A, "EFM8LB11F32E_QFP32"},
	{0x34, 0x4B, "EFM8LB11F32E_QSOP24"},
	{0x34, 0x4C, "EFM8LB11F32E_QFN24"},
	{0x34, 0x4D, "EFM8LB11F16E_QFN32"},
	{0x34, 0x4E, "EFM8LB11F16E_QFP32"},
	{0x34, 0x4F, "EFM8LB11F16E_QSOP24"},
	{0x34, 0x50, "EFM8LB11F16E_QFN24"},
	{0x34, 0x51, "EFM8LB10F16E_QFN32"},
	{0x34, 0x52, "EFM8LB10F16E_QFP32"},
	{0x34, 0x53, "EFM8LB10F16E_QSOP24"},
	{0x34, 0x54, "EFM8LB10F16E_QFN24"},
	{0x34, 0x61, "EFM8LB12F64ES0_QFN32"},
	{0x34, 0x64, "EFM8LB12F64ES0_QFN24"},
	{0x34, 0x65, "EFM8LB12F32ES0_QFN32"},
	{0x34, 0x68, "EFM8LB12F32ES0_QFN24"},
	{0x34, 0x69, "EFM8LB11F32ES0_QFN32"},
	{0x34, 0x6C, "EFM8LB11F32ES0_QFN24"},
	{0x34, 0x6D, "EFM8LB11F16ES0_QFN32"},
	{0x34, 0x70, "EFM8LB11F16ES0_QFN24"},
	{0x34, 0x71, "EFM8LB10F16ES0_QFN32"},
	{0x34, 0x74, "EFM8LB10F16ES0_QFN24"},
	{0x00, 0x00, ""}
};

// This bootloader was obtained using the 'dump.c' program from a working EFM8LB1.
const unsigned char Bootloader[]={
/*fa00*/ 0x90, 0x00, 0x00, 0xe4, 0x93, 0xf4, 0x60, 0x18, 0xe5, 0xef, 0xb4, 0x10, 0x08, 0xe8, 0x64, 0xa5,
/*fa10*/ 0x60, 0x0e, 0x02, 0x00, 0x00, 0x54, 0x03, 0x60, 0xf9, 0x78, 0x16, 0x20, 0xb7, 0xf4, 0xd8, 0xfb,
/*fa20*/ 0x75, 0x81, 0x10, 0x02, 0xfa, 0x9c, 0x71, 0xd1, 0x8e, 0x08, 0x8f, 0x09, 0xad, 0x10, 0x71, 0x38,
/*fa30*/ 0x50, 0x23, 0xe5, 0x0d, 0xb4, 0x02, 0x06, 0xaf, 0x09, 0xae, 0x08, 0x71, 0x2a, 0xe5, 0x10, 0x60,
/*fa40*/ 0x17, 0x71, 0xc6, 0xad, 0x07, 0xaf, 0x09, 0xae, 0x08, 0x71, 0x31, 0x05, 0x09, 0xe5, 0x09, 0x70,
/*fa50*/ 0xec, 0x05, 0x08, 0x80, 0xe8, 0x75, 0x0c, 0x41, 0x22, 0x71, 0xd1, 0x8e, 0x08, 0x8f, 0x09, 0x71,
/*fa60*/ 0xd1, 0x75, 0xa7, 0x20, 0x43, 0xce, 0x08, 0xd3, 0xe5, 0x09, 0x9f, 0xe5, 0x08, 0x9e, 0x50, 0x14,
/*fa70*/ 0x85, 0x09, 0x82, 0x85, 0x08, 0x83, 0xe4, 0x93, 0xf5, 0xca, 0x05, 0x09, 0xe5, 0x09, 0x70, 0xe7,
/*fa80*/ 0x05, 0x08, 0x80, 0xe3, 0x71, 0xd1, 0xc0, 0x06, 0xc0, 0x07, 0x71, 0x50, 0xd0, 0x05, 0xd0, 0x04,
/*fa90*/ 0xef, 0x6d, 0x70, 0x02, 0xee, 0x6c, 0x60, 0x03, 0x75, 0x0c, 0x43, 0x22, 0x71, 0x5f, 0xe4, 0xf5,
/*faa0*/ 0x0e, 0xf5, 0x0f, 0x71, 0xab, 0x71, 0xc6, 0xef, 0x24, 0xd0, 0xf5, 0x0d, 0x75, 0x0c, 0x40, 0xb4,
/*fab0*/ 0x07, 0x00, 0x50, 0x5a, 0x90, 0xfa, 0xba, 0x25, 0xe0, 0x73, 0x41, 0xc8, 0x41, 0xd9, 0x41, 0xe3,
/*fac0*/ 0x41, 0xe3, 0x41, 0xe7, 0x41, 0xeb, 0x61, 0x01, 0x71, 0xd1, 0xef, 0x64, 0x42, 0x70, 0x03, 0xee,
/*fad0*/ 0x64, 0x34, 0x60, 0x3d, 0x75, 0x0c, 0x42, 0x80, 0x38, 0x71, 0xc6, 0x8f, 0x0e, 0x71, 0xc6, 0x8f,
/*fae0*/ 0x0f, 0x80, 0x2e, 0x51, 0x26, 0x80, 0x2a, 0x51, 0x59, 0x80, 0x26, 0x71, 0xc6, 0xad, 0x07, 0x7e,
/*faf0*/ 0xfb, 0x7f, 0xfe, 0x71, 0x31, 0x71, 0xc6, 0xad, 0x07, 0x7e, 0xfb, 0x7f, 0xff, 0x71, 0x31, 0x80,
/*fb00*/ 0x10, 0x7f, 0x40, 0x71, 0xde, 0x78, 0x00, 0xe4, 0xf6, 0x75, 0xef, 0x12, 0x80, 0x03, 0x75, 0x0c,
/*fb10*/ 0x90, 0xaf, 0x0c, 0x71, 0xde, 0x80, 0x8c, 0x8f, 0x82, 0x8e, 0x83, 0x85, 0x0e, 0xb7, 0x85, 0x0f,
/*fb20*/ 0xb7, 0x43, 0x8f, 0x01, 0xed, 0xf0, 0x53, 0x8f, 0xfc, 0x22, 0x43, 0x8f, 0x02, 0xe4, 0xfd, 0x61,
/*fb30*/ 0x17, 0xed, 0xf4, 0x60, 0x02, 0x71, 0x17, 0x22, 0xc3, 0xee, 0x94, 0xfa, 0x50, 0x10, 0xed, 0x2f,
/*fb40*/ 0xff, 0xe4, 0x3e, 0xfe, 0xd3, 0xef, 0x94, 0x00, 0xee, 0x94, 0xfa, 0x50, 0x01, 0x22, 0xc3, 0x22,
/*fb50*/ 0x43, 0xce, 0x01, 0xaf, 0xcb, 0xef, 0xfe, 0xad, 0xcb, 0xed, 0xff, 0xe4, 0xf5, 0xa7, 0x22, 0x75,
/*fb60*/ 0x97, 0xde, 0x75, 0x97, 0xad, 0x43, 0xff, 0x80, 0x75, 0xef, 0x02, 0xe4, 0xf5, 0xa9, 0x75, 0xa4,
/*fb70*/ 0x10, 0x75, 0xe1, 0x01, 0x75, 0xe3, 0x40, 0x75, 0xe4, 0xd0, 0x75, 0x8e, 0x08, 0x75, 0x89, 0x90,
/*fb80*/ 0xd2, 0x8e, 0x20, 0x85, 0xfd, 0x30, 0x85, 0xfd, 0xc2, 0x8e, 0xaf, 0x8d, 0xef, 0xfe, 0xad, 0x8b,
/*fb90*/ 0xed, 0xff, 0xee, 0xc3, 0x13, 0xef, 0x13, 0xf4, 0x04, 0xf5, 0x8d, 0x75, 0x89, 0x20, 0xd2, 0x8e,
/*fba0*/ 0xd2, 0x9c, 0x22, 0x30, 0x98, 0xfd, 0xc2, 0x98, 0xaf, 0x99, 0x22, 0x71, 0xa3, 0xbf, 0x24, 0xfb,
/*fbb0*/ 0x71, 0xa3, 0xae, 0x07, 0x8e, 0x10, 0xee, 0x60, 0x0c, 0x71, 0xa3, 0xf5, 0x82, 0x75, 0x83, 0x00,
/*fbc0*/ 0xef, 0xf0, 0x1e, 0x80, 0xf1, 0x22, 0x85, 0x10, 0x82, 0x75, 0x83, 0x00, 0xe0, 0xff, 0x15, 0x10,
/*fbd0*/ 0x22, 0x71, 0xc6, 0x8f, 0x0a, 0x71, 0xc6, 0x8f, 0x0b, 0xae, 0x0a, 0xaf, 0x0b, 0x22, 0xc2, 0x99,
/*fbe0*/ 0x8f, 0x99, 0x30, 0x99, 0xfd, 0x22, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
/*fbf0*/ 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x90, 0xa5, 0xff };

