maya-taylor/Project2ELEC291/JDY40 EFM8 Files/EFM8 Example Code/Clon/Clon_EFM8LB1.c
unsigned char C2_ReadSFR (unsigned char sfraddress)
{
   unsigned char j;
   C2_WriteAR (sfraddress);
   j=C2_ReadDR ();
   Poll_InBusy; // Wait for input acknowledge
   return j;
}

// C2_Init: Initializes the C2 Interface for FLASH programming
void C2_Init(void)
{
   C2_Reset();    // Reset the target device
   Timer3us(2);   // Delay for at least 2us
 
   // FPCTL: Flash Programming Control Register.
   // This register is used to enable Flash programming via the C2 interface. To enable C2
   // Flash programming, the following codes must be written in order: 0x02, 0x01. Note
   // that once C2 Flash programming is enabled, a system reset must be issued to
   // resume normal operation.
   
   C2_WriteAR(FPCTL); // Target the C2 FLASH Programming Control register (FPCTL)
   C2_WriteDR(0x02);  // Write the first key code to enable C2 FLASH programming
   C2_WriteDR(0x01);  // Write the second key code to enable C2 FLASH programming
   waitms(20);        // Delay for at least 20ms to ensure the target is ready for C2 FLASH programming
   
   // EFM8LB1 Device-Specific Programming Sequences.  This comes from
   // Silabs' Application Note AN127:
   // VDD Monitor Initialization:
   C2_WriteSFR(0xFF, 0x80);
   Timer3us(5); //Delay 5 us
   C2_WriteSFR(0xEF, 0x02);
   // Oscillator Initialization:
   C2_WriteSFR(0xA9, 0x00);
}

// C2_GetDevID:  Reads the target Device ID register
unsigned char C2_GetDevID(void)
{
   C2_WriteAR(DEVICEID); // Select DeviceID register for C2 Data register accesses
   return C2_ReadDR();   // Read and return the DeviceID register
}

// C2_GetRevID: Reads Revision ID register
unsigned char C2_GetRevID(void)
{
   C2_WriteAR(REVID);   // Select REVID regsiter for C2 Data register accesses
   return C2_ReadDR();  // Read and return the DeviceID register
}

// C2_BlockRead:
// - Reads a block of FLASH memory starting at <FLASH_ADDR>
// - The size of the block is defined by <NUM_BYTES>
// - Stores the read data at the location targeted by the pointer <C2_PTR>
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
//
char C2_BlockRead(void)
{
   unsigned char i;        // Counter
   unsigned char status;   // FPI status information holder

   C2_WriteAR(FPDAT);      // Select the FLASH Programming Data register for C2 Data register accesses
   C2_WriteDR(BLOCK_READ); // Send FLASH block read command
   Poll_InBusy;            // Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK) return 0; // Exit and indicate error
   
   C2_WriteDR(FLASH_ADDR >> 8);        // Send address high byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(FLASH_ADDR & 0x00FF);    // Send address low byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(NUM_BYTES);              // Send block size
   Poll_InBusy;                        // Wait for input acknowledge

   // Check status before reading FLASH block
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error
   
   // Read FLASH block
   for (i=0;i<NUM_BYTES;i++)
   {
      Poll_OutReady;                   // Wait for data ready indicator
      *C2_PTR++ = C2_ReadDR();         // Read data from the FPDAT register
   }
   return 1;                           // Exit and indicate success
}

// C2_BlockWrite:
// - Writes a block of FLASH memory starting at <FLASH_ADDR>
// - The size of the block is defined by <NUM_BYTES>
// - Writes the block stored at the location targetted by <C2_PTR>
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
//
char C2_BlockWrite(void)
{
   unsigned char i;                    // Counter
   unsigned char status;               // FPI status information holder

   C2_WriteAR(FPDAT);                  // Select the FLASH Programming Data register 
                                       // for C2 Data register accesses
   C2_WriteDR(BLOCK_WRITE);            // Send FLASH block write command
   Poll_InBusy;                        // Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error

   C2_WriteDR(FLASH_ADDR >> 8);        // Send address high byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(FLASH_ADDR & 0x00FF);    // Send address low byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(NUM_BYTES);              // Send block size
   Poll_InBusy;                        // Wait for input acknolwedge

   // Check status before writing FLASH block
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error

   // Write FLASH block
   for (i=0;i<NUM_BYTES;i++)
   {
      C2_WriteDR(*C2_PTR++);           // Write data to the FPDAT register
      Poll_InBusy;                     // Wait for input acknowledge
   }   

   Poll_OutReady;                      // Wait for last FLASH write to complete
   return 1;                           // Exit and indicate success
}

// C2_PageErase:
// - Erases a 512-byte FLASH page
// - Targets the FLASH page containing the address <FLASH_ADDR>
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
char C2_PageErase(void)
{
   unsigned char page;                 // Target FLASH page
   unsigned char status;               // FPI status information holder

   page=(unsigned char)(FLASH_ADDR>>9);// <page> is the 512-byte sector containing the target <FLASH_ADDR>.

   if (page >= (NUM_PAGES-2))          // Check that target page is within range (NUM_PAGES minus 2 for reserved area)
      return 0;                        // Indicate error if out of range
   C2_WriteAR(FPDAT);                  // Select the FLASH Programming Data register for C2 Data register accesses
   C2_WriteDR(PAGE_ERASE);             // Send FLASH page erase command Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error
   
