maya-taylor/Project2ELEC291/JDY40 EFM8 Files/EFM8 Example Code/Clon/Clon_EFM8LB1.c
   C2_WriteDR(page);                   // Send FLASH page number
   Poll_InBusy;                        // Wait for input acknowledge

   Poll_OutReady;                      // Wait for ready indicator
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error
   
   C2_WriteDR(0x00);                   // Dummy write to initiate erase
   Poll_InBusy;                        // Wait for input acknowledge

   Poll_OutReady;                      // Wait for erase operation to complete
   return 1;                           // Exit and indicate success
}

// C2_Device_Erase:
// - Erases the entire FLASH memory space
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
char C2_DeviceErase(void)
{
   unsigned char status;       // FPI status information holder

   C2_WriteAR(FPDAT);          // Select the FLASH Programming Data register for C2 Data register accesses
   C2_WriteDR(DEVICE_ERASE);   // Send Device Erase command
   Poll_InBusy;                // Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;               // Wait for status information
   status = C2_ReadDR();        // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                 // Exit and indicate error

   // Send a three-byte arming sequence to enable the device erase. If the sequence
   // is not received correctly, the command will be ignored.
   // Sequence: 0xDE, 0xAD, 0xA5.
   C2_WriteDR(0xDE);  // Arming sequence command 1
   Poll_InBusy;       // Wait for input acknowledge

   C2_WriteDR(0xAD);  // Arming sequence command 2
   Poll_InBusy;       // Wait for input acknowledge

   C2_WriteDR(0xA5);  // Arming sequence command 3
   Poll_InBusy;       // Wait for input acknowledge

   Poll_OutReady;     // Wait for erase operation to complete

   return 1;          // Exit and indicate success
}

void main (void)
{
	unsigned int i, j; // Misc. counters

	printf("\x1b[2JEFM8LB1 Clonner.\n"
	       "Based on Cygnal application note AN027 and Silicon Labs application note AN127\n"
		   "By Jesus Calvino-Fraga (2008-2018)\n\n");
	
	while(1)
	{
	    printf("Press a key or the 'BOOT' pushbutton to start.\n");
		RLED=LEDOFF;
		GLED=LEDOFF;
		YLED=LEDOFF;
		C2D_DriverOn;
		C2CK=LOW;
		C2D=LOW;
		PWR=PWROFF; // Power-off device
		
		while((FGO==1) && (RI==0)) // Blinking Green LED indicates new device can be inserted
		{
			GLED=(!GLED);
			YLED=(!YLED);
			waitms(300);
		}
		if(RI) getchar();
		GLED=LEDON;
		YLED=LEDON;
		PWR=PWRON; // Power-on device
		waitms(300);
		C2D_DriverOff;
		C2CK=HIGH;
		while(FGO==0);
		GLED=LEDOFF;
		YLED=LEDOFF;
		
		// Read Device ID
		C2_Reset();        // Reset target
		j = C2_GetDevID(); 
   
		printf("Checking for EFM8LB1 microcontroller...");
		if (j != id[1].device_id)
		{
			printf("\nERROR: EFM8LB1 device not present!\n");
			RLED=LEDON;
			goto the_end;
		}
		printf(" Done.\n");
		
		j = C2_ReadSFR(0xAD);
		printf("Checking for %s microcontroller...", id[1].description);
		if (j != id[1].derivative_id)
		{
			printf("\nERROR: %s device not present! (%02x)\n", id[1].description, j);
			RLED=LEDON;
			goto the_end;
		}
		printf(" Done.\n");
		
		// Initiate C2 FLASH Programming
		C2_Reset();  // Start with a target device reset
		C2_Init();   // Enable FLASH programming via C2
		
		printf("Erasing the flash memory...");
		C2_DeviceErase(); // Erase entire code space
		printf(" Done.\n");
		
		printf("Verifying that the flash memory is blank...");
		// Read back entire FLASH memory (should be all '1's)
		for (i=0; i<NUM_BLOCKS; i++) // Perform block reads (0x0000 to 0xFBFF)
		{
			FLASH_ADDR = i*BLOCK_SIZE;    // Set target addresss
			NUM_BYTES = BLOCK_SIZE;       // Set number of bytes to read
			C2_PTR = R_BUF;               // Initialize C2 pointer to the read buffer
			C2_BlockRead();               // Initiate FLASH read            
			for (j=0; j<BLOCK_SIZE; j++)  // Check read data
			{
				if (R_BUF[j] != 0xFF)
				{
					printf("\nERROR: flash memory is not blank. @%04x=%02x\n", FLASH_ADDR+j, R_BUF[j]);
					RLED=LEDON;
					goto the_end;
				}
			}
		}
		printf(" Done.\n");

		printf("Copying from source to target...");
		for (i=0; i<NUM_BLOCKS; i++) // Perform block write/reads
		{
			// Write FLASH block
			FLASH_ADDR = i*BLOCK_SIZE;
			NUM_BYTES = BLOCK_SIZE;
			memcpy(W_BUF, (code unsigned char *)FLASH_ADDR, BLOCK_SIZE);
			// Is the page to write full of 0xff?
			for (j=0; j<BLOCK_SIZE; j++)
			{
				if (W_BUF[j] != 0xFF) break;
			}
			if(j!=BLOCK_SIZE) // At least one byte is not 0xff, so write the block.
			{
				C2_PTR = W_BUF;
				C2_BlockWrite();
			
				// Read back FLASH block
				FLASH_ADDR = i*BLOCK_SIZE;
				NUM_BYTES = BLOCK_SIZE;
				C2_PTR = R_BUF;
				C2_BlockRead();
				
				if (memcmp(R_BUF, W_BUF, BLOCK_SIZE) != 0) // Verify written bytes
				{
					printf("\nERROR: Memory flash failed.\n");
					RLED=LEDON;
					goto the_end;
				}
			}
		}
	
		printf(" Done.\n");
		GLED=LEDON;
		YLED=LEDON;
		C2_Reset();
		printf("The LED connected to the target EFM8LB1 P2.1 should be blinking.\n\n");
				
		the_end:
	    printf("Press a key or the 'BOOT' pushbutton to continue.\n");
		
		//Display the result of the flashing proccess until button pressed
		while((FGO==1)&&(RI==0));
		if(RI) getchar();
		waitms(100); //Debounce...
		while(FGO==0);
		waitms(100); //Debounce...
	}
}   

